Revit 2024 API
WallpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintFinish" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WallpaintFinishType
Visual Basic
Public Enumeration WallpaintFinishType
Visual C++
public enum class WallpaintFinishType
Members
Member name | Description
Flat
Eggshell
Platinum
Pearl
Semigloss
Gloss
See Also
Autodesk.Revit.DB.Visual Namespace